#pragma once
//
//ds_htoken.h
//

#ifndef __DS_HTOKEN_H__
#define __DS_HTOKEN_H__

#include "ds_common.h"

typedef struct _ONE_WORD
{
	char* strOneWord;
}ONE_WROD_TOKEN;

typedef struct _TWO_WORD
{
	char* strOneWord;
	char* strTwoWord;
}TWO_WORD_TOKEN;

typedef struct _THREE_WORD
{
	char* strOneWord;
	char* strTwoWord;
	char* strThreeWord;
}THREE_WORD_TOKEN;

typedef struct _FOUR_WORD
{
	char* strOneWord;
	char* strTwoWord;
	char* strThreeWord;
	char* strFourWord;

}FOUR_WORD_TOKEN;


#define STEM_DIC	0/* 사전구분  */
#define END_DIC		1

#define STEM_WILD 0/* Wild Stem Dic  */
#define EOMI_WILD 1/* Wild End Dic  */

#define END_TOTAL_ENTRY 3510

#define ALL_TABLE_01 59
#define ALL_TABLE_02 11
#define ALL_TABLE_03 3
#define ALL_TABLE_04 10
#define ALL_TABLE_05 10
#define ALL_TABLE_06 9
#define ALL_TABLE_07 8 
#define ALL_TABLE_08 10
#define ALL_TABLE_09 8
#define ALL_TABLE_10 27

/* 미등록어 테이블  */
#define ALL_TABLE_001 39
#define ALL_TABLE_002 10
#define ALL_TABLE_003 8
#define ALL_TABLE_004 27

#define ALL_TABLE_005 6
#define ALL_TABLE_006 11
#define ALL_TABLE_007 26
#define ALL_TABLE_008 109
#define ALL_TABLE_009 143

#define CALCULATE_MINUS 0
#define CALCULATE_PLUS  1
#define CALCULATE_STOP  2

#define OLD_ARRAY 1
#define NEW_ARRAY 2

#define REPLACE_HANGUL_JA00 0 /* 'ㄱ'  */
#define REPLACE_HANGUL_JA01 1 /* 'ㄴ'  */
#define REPLACE_HANGUL_JA02 2 /* 'ㄷ'  */
#define REPLACE_HANGUL_JA03 3 /* 'ㄹ'  */
#define REPLACE_HANGUL_JA04 4 /* 'ㅁ'  */
#define REPLACE_HANGUL_JA05 5 /* 'ㅂ'  */
#define REPLACE_HANGUL_JA06 6 /* 'ㅅ'  */
#define REPLACE_HANGUL_JA07 7 /* 'ㅇ'  */
#define REPLACE_HANGUL_JA08 8 /* 'ㅈ'  */
#define REPLACE_HANGUL_JA09 9 /* 'ㅊ'  */
#define REPLACE_HANGUL_JA10 10 /* 'ㅋ'  */
#define REPLACE_HANGUL_JA11 11 /* 'ㅌ'  */
#define REPLACE_HANGUL_JA12 12 /* 'ㅍ'  */
#define REPLACE_HANGUL_JA13 13 /* 'ㅎ'  */
#define REPLACE_HANGUL_JA14 14 /* NULL  */

#define FORCE_REPLACE_ONEWORD 0 /* 한 음절 변경   */
#define FORCE_REPLACE_ENDWORD 1 /* 한 음절 중 자소 변경    */


#define CHANGE_FIRST_START 0
#define CHANGE_SECOND_START 1
#define CHANGE_THIRD_START 2

#define FIRST_VAR 1
#define SECOND_VAR 2

#define ALL_AMB_SCRIPT 3
#define STEM_AMB_SCRIPT 2
#define END_AMB_SCRIPT 1


/* 축약형  */
static THREE_WORD_TOKEN Table01[] = {
	{ "겨", "기", "어" },{ "과", "고", "어" },{ "괘", "괴", "어" },{ "궈", "구", "어" },{ "꺼", "끄", "어" },
	{ "껴", "끼", "어" },{ "꽈", "꼬", "어" },{ "꽤", "꾀", "어" },{ "꿔", "꾸", "어" },{ "녀", "니", "어" },
	{ "놰", "뇌", "어" },{ "눠", "누", "어" },{ "뎌", "디", "어" },{ "둬", "두", "어" },{ "떠", "뜨", "어" },
	{ "뗘", "띠", "어" },{ "뙈", "뙤", "어" },{ "려", "리", "어" },{ "O", "뢰", "어" },{ "뤄", "루", "어" },
	{ "며", "미", "어" },{ "뫄", "모", "어" },{ "벼", "비", "어" },{ "봐", "보", "어" },{ "봬", "뵈", "어" },
	{ "빠", "쁘", "어" },{ "뻐", "쁘", "어" },{ "뼈", "삐", "어" },{ "쇄", "쇠", "어" },{ "숴", "수", "어" },
	{ "써", "쓰", "어" },{ "쏴", "쏘", "어" },{ "쐐", "쐬", "어" },{ "쒀", "쑤", "어" },{ "와", "오", "어" },
	{ "왜", "외", "어" },{ "워", "우", "어" },{ "져", "지", "어" },{ "좌", "조", "어" },{ "좨", "죄", "어" },
	{ "줘", "주", "어" },{ "쪄", "찌", "어" },{ "쫘", "쪼", "어" },{ "쫴", "쬐", "어" },{ "쭤", "쭈", "어" },
	{ "쳐", "치", "어" },{ "춰", "추", "어" },{ "커", "크", "어" },{ "켜", "키", "어" },{ "쿼", "쿠", "어" },
	{ "터", "트", "어" },{ "텨", "티", "어" },{ "퉈", "투", "어" },{ "파", "프", "어" },{ "퍼", "프", "어" },
	{ "펴", "피", "어" },{ "혀", "히", "어" },{ "화", "호", "어" },{ "놔", "놓", "어" }
};

/* 으불규칙  */
static THREE_WORD_TOKEN Table02[] = {
	{ "그", "거", "가" },{ "끄", "꺼", "" },{ "느", "너", "" },{ "뜨", "떠", "" },{ "", "", "" },
	{ "쁘", "빠", "뻐" },{ "쓰", "써", "" },{ "으", "아", "" },{ "크", "커", "" },{ "트", "터", "" },
	{ "프", "파", "퍼" }
};

/* 하다, 되다 처리  */
static TWO_WORD_TOKEN Table03[] = {
	{ "하","해" },{ "되","돼" },{ "받","받" }
};

/* ㅎ불규칙   */
static FOUR_WORD_TOKEN Table04[] = {
	{ "갛","가","간","개" },{ "겋","거","건","개" },{ "닿","다","단","대" },{ "떻","떠","떤","때" },
	{ "랗","라","란","래" },{ "렇","러","런","래" },{ "맣","마","만","매" },{ "멓","머","먼","매" },
	{ "얗","야","얀","얘" },{ "옇","여","연","애" }
};

/* ㄷ불규칙  */
static ONE_WROD_TOKEN Table05[] = {
	{ "걸" },{ "결" },{ "길" },{ "눌" },{ "들" },{ "달" },{ "물" },{ "불" },{ "실" },{ "컬" }
};

/* ㅅ불규칙  */
static ONE_WROD_TOKEN Table06[] = {
	{ "그" },{ "끄" },{ "나" },{ "무" },{ "부" },{ "이" },{ "자" },{ "저" },{ "지" }
};

static ONE_WROD_TOKEN Table07[] = {
	{ "있" },{ "없" },{ "케" },{ "록" },{ "치" },{ "셔" },{ "키" },{ "세" }
};

static TWO_WORD_TOKEN Table08[] = {
	{ "영","0" },{ "일","1" },{ "이","2" },{ "삼","3" },{ "사","4" },
	{ "오","5" },{ "육","6" },{ "칠","7" },{ "팔","8" },{ "구","9" }
};

static TWO_WORD_TOKEN Table09[] = {
	{ "십","1" },{ "백","2" },{ "천","3" },{ "만","4" },{ "억","8" },
	{ "조","12" },{ "경","16" },{ "해","20" }
};

static TWO_WORD_TOKEN Table10[] = {
	{ "번","Tim" },{ "개", "Pi" },{ "명", "Ps" },{ "회", "Rd" },
	{ "회전","Rd" },{ "차","Rd" },{ "차전","Rd" },{ "초","Sec" },
	{ "분","Min" },{ "시","Hur" },{ "일","Dy" },{ "월","Mn" },{ "년","Yr" },
	{ "그램","Gr" },{ "킬로","Ki" },{ "키로","Ki" },{ "킬로그램","Kg" },{ "키로그램","Kg" },
	{ "센치","Cm" },{ "센치미터","Cm" },{ "센티", "Cm" },{ "센티미터", "Cm" },{ "미리","Mm" },
	{ "밀리","Mm" },{ "미리미터","Mm" },{ "밀리미터","Mm" },{ "미터","M" }
};


/* 미등록어 테이블  */
static ONE_WROD_TOKEN Table001[] = {
	{ "나" },{ "났" },{ "날" },{ "납" },{ "냈" },{ "냅" },{ "낸" },{ "낼" },{ "내" },{ "주" },
	{ "준" },{ "줄" },{ "줘" },{ "줍" },{ "줬" },{ "보" },{ "본" },{ "봤" },{ "볼" },{ "봐" },
	{ "봅" },{ "대" },{ "댔" },{ "댄" },{ "댈" },{ "댑" },{ "두" },{ "둔" },{ "둘" },{ "둡" },
	{ "뒀" },{ "둬" },{ "하" },{ "해" },{ "했" },{ "합" },{ "한" },{ "할" },{ "가" },{ "갑" },
	{ "갈" },{ "간" },{ "갔" },{ "오" },{ "온" },{ "왔" },{ "와" },{ "옵" },{ "올" }
};

static TWO_WORD_TOKEN Table002[] = {
	{ "영","0" },{ "일","1" },{ "이","2" },{ "삼","3" },{ "사","4" },
	{ "오","5" },{ "육","6" },{ "칠","7" },{ "팔","8" },{ "구","9" }
};

static TWO_WORD_TOKEN Table003[] = {
	{ "십","1" },{ "백","2" },{ "천","3" },{ "만","4" },{ "억","8" },
	{ "조","12" },{ "경","16" },{ "해","20" }
};

static TWO_WORD_TOKEN Table004[] = {
	{ "번","Tim" },{ "개", "Pi" },{ "명", "Ps" },{ "회", "Rd" },
	{ "회전","Rd" },{ "차","Rd" },{ "차전","Rd" },{ "초","Sec" },
	{ "분","Min" },{ "시","Hur" },{ "일","Dy" },{ "월","Mn" },{ "년","Yr" },
	{ "그램","Gr" },{ "킬로","Ki" },{ "키로","Ki" },{ "킬로그램","Kg" },{ "키로그램","Kg" },
	{ "센치","Cm" },{ "센치미터","Cm" },{ "센티", "Cm" },{ "센티미터", "Cm" },{ "미리","Mm" },
	{ "밀리","Mm" },{ "미리미터","Mm" },{ "밀리미터","Mm" },{ "미터","M" }
};

static ONE_WROD_TOKEN Table005[] = { /*  다섯 음절인 단위성의존명사 (6)  */
	{ "테라바이트" },{ "킬로헤르츠" },{ "메가헤르츠" },{ "기가바이트" },{ "메가바이트" },
	{ "세제곱미터" }
};

static ONE_WROD_TOKEN Table006[] = { /*  네 음절인 단위성의존명사 (11)  */
	{ "키로그램" },{ "킬로그램" },{ "킬로와트" },{ "밀리그램" },{ "밀리미터" },
	{ "데나리온" },{ "옹스트롬" },{ "센티미터" },{ "미리미터" },{ "센치미터" },
	{ "천만달러" }
};

static ONE_WROD_TOKEN Table007[] = { /*  세 음절인 단위성의존명사 (26)  */
	{ "페이지" },{ "퍼센트" },{ "코페크" },{ "포인트" },{ "페세타" },
	{ "파운드" },{ "필모어" },{ "마르크" },{ "마지기" },{ "라운드" },
	{ "루피아" },{ "무더기" },{ "개짜리" },{ "원짜리" },{ "살짜리" },
	{ "에이커" },{ "바이트" },{ "십만원" },{ "백만원" },{ "천만원" },
	{ "십억원" },{ "백억원" },{ "천억원" },{ "억달러" },{ "만달러" },
	{ "천달러" }
};


static ONE_WROD_TOKEN Table008[] = { /*  두 음절인 단위성의존명사 (109)  */
	{ "마력" },{ "광년" },{ "개항" },{ "모금" },{ "공기" },{ "군데" },{ "개국" },{ "가락" },{ "대접" },{ "가마" },
	{ "동강" },{ "뭉치" },{ "오리" },{ "사리" },{ "밀리" },{ "세기" },{ "동이" },{ "짜리" },{ "프랑" },{ "키로" },
	{ "피트" },{ "토막" },{ "차선" },{ "켤레" },{ "포기" },{ "호선" },{ "킬로" },{ "캐럿" },{ "마일" },{ "개월" },
	{ "부작" },{ "갤런" },{ "발짝" },{ "볼트" },{ "그램" },{ "대손" },{ "망정" },{ "두름" },{ "달러" },{ "개소" },
	{ "년도" },{ "년대" },{ "년경" },{ "단돈" },{ "년간" },{ "마디" },{ "개비" },{ "번씩" },{ "길더" },{ "봉지" },
	{ "다발" },{ "루수" },{ "루블" },{ "배럴" },{ "메가" },{ "그루" },{ "다스" },{ "루블" },{ "주간" },{ "섹터" },
	{ "센티" },{ "센트" },{ "어치" },{ "원씩" },{ "인치" },{ "온스" },{ "주년" },{ "야드" },{ "송이" },{ "주일" },
	{ "인승" },{ "세대" },{ "자락" },{ "자루" },{ "이닝" },{ "가지" },{ "기가" },{ "센치" },{ "미리" },{ "미터" },
	{ "회전" },{ "차전" },{ "시간" },{ "인분" },{ "비트" },{ "번지" },{ "학기" },{ "십원" },{ "백원" },{ "천원" },
	{ "만원" },{ "억원" },{ "기압" },{ "단계" },{ "분기" },{ "학년" },{ "천번" },{ "등급" },{ "리터" },{ "가구" },
	{ "일경" },{ "제대" },{ "타수" },{ "안타" },{ "년말" },{ "년초" },{ "조원" },{ "차례" },{ "순위" }
};

static ONE_WROD_TOKEN Table009[] = { /*  한 음절인 단위성의존명사 (143)  */
	{ "반" },{ "과" },{ "경" },{ "관" },{ "곳" },{ "교" },{ "병" },{ "곡" },{ "놈" },{ "격" },
	{ "명" },{ "섬" },{ "뼘" },{ "권" },{ "방" },{ "발" },{ "등" },{ "건" },{ "집" },{ "박" },
	{ "심" },{ "접" },{ "속" },{ "끼" },{ "보" },{ "되" },{ "개" },{ "배" },{ "파" },{ "가" },
	{ "곱" },{ "폭" },{ "탕" },{ "정" },{ "타" },{ "매" },{ "두" },{ "동" },{ "근" },{ "석" },
	{ "치" },{ "자" },{ "겹" },{ "시" },{ "호" },{ "채" },{ "막" },{ "죽" },{ "삭" },{ "구" },
	{ "세" },{ "점" },{ "원" },{ "모" },{ "제" },{ "축" },{ "통" },{ "척" },{ "해" },{ "탄" },
	{ "번" },{ "진" },{ "간" },{ "부" },{ "올" },{ "질" },{ "할" },{ "켠" },{ "갑" },{ "길" },
	{ "선" },{ "전" },{ "단" },{ "열" },{ "마" },{ "말" },{ "도" },{ "절" },{ "몰" },{ "날" },
	{ "걸" },{ "알" },{ "살" },{ "줄" },{ "켜" },{ "차" },{ "본" },{ "조" },{ "인" },{ "분" },
	{ "일" },{ "실" },{ "푼" },{ "잔" },{ "기" },{ "달" },{ "대" },{ "판" },{ "주" },{ "촉" },
	{ "필" },{ "행" },{ "칙" },{ "착" },{ "쪽" },{ "패" },{ "편" },{ "획" },{ "층" },{ "첩" },
	{ "촌" },{ "초" },{ "홉" },{ "환" },{ "톨" },{ "톤" },{ "체" },{ "칸" },{ "평" },{ "회" },
	{ "닢" },{ "륜" },{ "급" },{ "년" },{ "냥" },{ "량" },{ "눔" },{ "월" },{ "종" },{ "줌" },
	{ "쌍" },{ "엔" },{ "장" },{ "십" },{ "백" },{ "천" },{ "만" },{ "억" },{ "항" },{ "범" },
	{ "위" },{ "표" },{ "당" }
};

#define NAME_TABLE 95
#define PERSON_TABLE 76
#define BOILER_TABLE 13
#define LOCAL_TABLE 3

static ONE_WROD_TOKEN NAMETable[] = { /*  이름 테이블  */
	{ "가" },{ "간" },{ "감" },{ "강" },{ "고" },{ "공" },{ "곽" },{ "구" },{ "국" },{ "궁" },
	{ "권" },{ "금" },{ "기" },{ "길" },{ "김" },{ "나" },{ "남" },{ "노" },{ "도" },{ "류" },
	{ "마" },{ "맹" },{ "명" },{ "모" },{ "문" },{ "민" },{ "박" },{ "반" },{ "방" },{ "배" },
	{ "백" },{ "범" },{ "변" },{ "빈" },{ "사" },{ "서" },{ "석" },{ "선" },{ "설" },{ "섭" },
	{ "성" },{ "소" },{ "손" },{ "송" },{ "시" },{ "신" },{ "심" },{ "안" },{ "양" },{ "엄" },
	{ "여" },{ "연" },{ "염" },{ "영" },{ "오" },{ "옥" },{ "온" },{ "왕" },{ "용" },{ "우" },
	{ "원" },{ "유" },{ "윤" },{ "은" },{ "음" },{ "이" },{ "인" },{ "임" },{ "장" },{ "전" },
	{ "정" },{ "제" },{ "조" },{ "주" },{ "지" },{ "진" },{ "차" },{ "창" },{ "채" },{ "천" },
	{ "최" },{ "추" },{ "탁" },{ "태" },{ "편" },{ "표" },{ "하" },{ "한" },{ "함" },{ "허" },
	{ "현" },{ "호" },{ "홍" },{ "화" },{ "황" }
};

static ONE_WROD_TOKEN PERSONTable[] = { /*  직위,인물표지 테이블  */
	{ "씨" },{ "님" },{ "의원" },{ "기자" },{ "총리" },{ "부총리" },{ "대표" },{ "장관" },{ "외교장관" },{ "국무장관" },
	{ "차관보" },{ "대통령" },{ "부통령" },{ "총재" },{ "대변인" },{ "두대변인" },{ "총무" },{ "원장" },{ "부원장" },{ "위원장" },
	{ "부위원장" },{ "정책국장" },{ "국장" },{ "회장" },{ "사장" },{ "부사장" },{ "부장" },{ "상무" },{ "교수" },{ "재경장관" },
	{ "대표이사" },{ "이사" },{ "CEO" },{ "CTO" },{ "교장" },{ "선생님" },{ "국무총리" },{ "노동장관" },{ "광복회장" },{ "보좌관" },
	{ "외교보좌관" },{ "국장" },{ "사무국장" },{ "의장" },{ "하원의장" },{ "하원" },{ "상원" },{ "상원의원" },{ "하원의원" },{ "검찰청장" },
	{ "지도자" },{ "검찰총장" },{ "소령" },{ "중령" },{ "대령" },{ "감독" },{ "대표" },{ "총장" },{ "소장" },{ "부소장" },
	{ "행장" },{ "재경부차관" },{ "수석" },{ "전대통령" },{ "부시장" },{ "시장" },{ "청장" },{ "박사" },{ "차관" },{ "고문" },{ "실장" },
	{ "변호사" },{ "검사" },{ "판사" },{ "보좌관" },{ "대행" }
};

static ONE_WROD_TOKEN BOILERTable[] = { /*  기관표지 테이블  */
	{ "위원회" },{ "조합" },{ "협회" },{ "공단" },{ "센터" },{ "연합회" },{ "연구소" },{ "본부" },{ "학교" },
	{ "대학교" },{ "공화국" },{ "보안국" },{ "련합회" }
};

static ONE_WROD_TOKEN LOCALTable[] = { /*  지역표지 테이블  */
	{ "산" },{ "강" },{ "기념관" }
};

typedef struct MapItem_tag {
	char*  m_Key;
	int    m_Value;
} MapItem;

#define MAX_ID 105
#define MAX_PB 38

static MapItem arryMapItemID[MAX_ID] = {
	{ "잇", 1 },{ "잇따르", 1 },{ "뒤잇", 1 },{ "비하", 2 },{ "의하", 3 },		// 001-005
	{ "따르", 3 },{ "불구하", 4 },{ "인하", 5 },{ "않", 6 },{ "들", 7 },			// 005-010
	{ "앞서", 8 },{ "오", 8 },{ "통하", 9 },{ "없이", 10 },{ "같이", 11 },		// 011-015
	{ "즉", 12 },{ "한편", 13 },{ "즉시", 13 },{ "설마", 14 },{ "한참", 15 },		// 016-020
	{ "채", 16 },{ "반면", 16 },{ "후", 16 },{ "뒤", 16 },{ "동안", 16 },		// 021-025
	{ "때", 16 },{ "편", 16 },{ "지", 16 },{ "당시", 16 },{ "만큼", 16 },		// 026-030
	{ "결과", 16 },{ "이후", 16 },{ "중", 17 },{ "가운데", 17 },{ "바", 18 },			// 031-035
	{ "것", 19 },{ "상황", 19 },{ "등", 20 },{ "때문", 21 },{ "전", 21 },			// 036-040
	{ "마련", 21 },{ "십상", 21 },{ "예사", 21 },{ "일쑤", 21 },{ "경우", 22 },		// 041-045
	{ "이상", 22 },{ "모양", 23 },{ "예정", 23 },{ "방침", 23 },{ "계획", 23 },		// 046-050
	{ "전망", 23 },{ "터", 23 },{ "입장", 23 },{ "수", 24 },{ "적", 24 },			// 051-055
	{ "대하", 25 },{ "관하", 25 },{ "위하", 26 },{ "한하", 27 },{ "한", 28 },			// 056-060
	{ "관련", 29 },{ "관련하", 29 },{ "대로", 30 },{ "탓", 31 },{ "물론", 32 },		// 061-065
	{ "아니", 33 },{ "데", 34 },{ "추가", 35 },{ "당시", 36 },{ "바탕", 37 },		// 066-070
	{ "부서지", 38 },{ "같", 39 },{ "이같", 40 },{ "그같", 40 },{ "비롯", 41 },		// 071-075
	{ "포함", 41 },{ "비롯하", 42 },{ "대상", 43 },{ "상대", 43 },{ "가", 44 },			// 076-080
	{ "계기", 45 },{ "걸치", 46 },{ "대신", 47 },{ "관계", 48 },{ "이번", 49 },		// 081-085
	{ "지적", 50 },{ "대부분", 51 },{ "자진하", 52 },{ "징역", 53 },{ "경력", 53 },		// 086-090
	{ "이르", 54 },{ "시작하", 55 },{ "시간", 56 },{ "뿐", 57 },{ "셈", 58 },			// 091-095
	{ "직후", 13 },{ "소지", 24 },{ "잇달", 1 },{ "제외하", 59 },{ "빼", 59 },			// 096-100
	{ "외", 59 },{ "이외", 59 },{ "말", 59 },{ "포함하", 59 },{ "포함시키", 59 }	// 101-105
};

static MapItem arryMapItemPB[MAX_PB] = {
	{ "버리", 1 },{ "내", 1 },{ "주", 1 },{ "드리", 1 },{ "대", 1 },{ "두", 1 },{ "놓", 1 },{ "가지", 1 },{ "치우", 1 },{ "지", 1 },
	{ "오", 1 },{ "가", 1 },{ "나가", 1 },{ "바치", 1 },{ "빠지", 1 },{ "제치", 1 },{ "붙이", 1 },{ "보이", 1 },{ "달", 1 },{ "듯하", 2 },
	{ "뻔하", 2 },{ "체하", 2 },{ "만하", 2 },{ "양하", 2 },{ "척하", 2 },{ "하", 3 },{ "않", 4 },{ "못하", 4 },{ "아니하", 4 },{ "말", 5 },
	{ "보", 6 },{ "싶", 6 },{ "계시", 7 },{ "싶어하", 7 },{ "만들", 8 },{ "되", 8 },{ "나", 9 },{ "있", 9 }
};

#endif
